-- Adding regions

-- fields: region_id, name

INSERT INTO regions VALUES (0, 'Північна Україна'), 
  (1, 'Південна Україна'), 
  (2, 'Західна Україна'), 
  (3, 'Східна Україна'), 
  (4, 'Центральна Україна');

-- Adding districts

-- fields: district_id, name, region_id

INSERT INTO districts VALUES (0, 'Автономна Республіка Крим', 1), 
  (1, 'Вінницька область', 4), 
  (2, 'Волинська область', 2), 
  (3, 'Дніпровська область', 3), 
  (4, 'Донецька область', 3), 
  (5, 'Житомирська область', 0), 
  (6, 'Закарпатська область', 2), 
  (7, 'Запорізька область', 1), 
  (8, 'Івано-Франківська область', 2), 
  (9, 'Київська область', 0), 
  (10, 'Кіровоградська область', 4), 
  (11, 'Луганська область', 3), 
  (12, 'Львівська область', 2), 
  (13, 'Миколаївська область', 1), 
  (14, 'Одеська область', 1), 
  (15, 'Полтавська область', 4), 
  (16, 'Рівненська область', 2), 
  (17, 'Сумська область', 0), 
  (18, 'Тернопільська область', 2), 
  (19, 'Харківська область', 3), 
  (20, 'Херсонська область', 1), 
  (21, 'Хмельницька область', 2), 
  (22, 'Черкаська область', 4), 
  (23, 'Чернівецька область', 2), 
  (24, 'Чернігівська область', 0);