-- Adding regions

-- fields: region_id, name

INSERT INTO regions VALUES (0, 'Північна Україна'), 
  (1, 'Південна Україна'), 
  (2, 'Західна Україна'), 
  (3, 'Східна Україна'), 
  (4, 'Центральна Україна');

-- Adding districts

-- fields: district_id, name, region_id

INSERT INTO districts VALUES (0, 'Автономна Республіка Крим', 1), 
  (1, 'Вінницька область', 4), 
  (2, 'Волинська область', 2), 
  (3, 'Дніпровська область', 3), 
  (4, 'Донецька область', 3), 
  (5, 'Житомирська область', 0), 
  (6, 'Закарпатська область', 2), 
  (7, 'Запорізька область', 1), 
  (8, 'Івано-Франківська область', 2), 
  (9, 'Київська область', 0), 
  (10, 'Кіровоградська область', 4), 
  (11, 'Луганська область', 3), 
  (12, 'Львівська область', 2), 
  (13, 'Миколаївська область', 1), 
  (14, 'Одеська область', 1), 
  (15, 'Полтавська область', 4), 
  (16, 'Рівненська область', 2), 
  (17, 'Сумська область', 0), 
  (18, 'Тернопільська область', 2), 
  (19, 'Харківська область', 3), 
  (20, 'Херсонська область', 1), 
  (21, 'Хмельницька область', 2), 
  (22, 'Черкаська область', 4), 
  (23, 'Чернівецька область', 2), 
  (24, 'Чернігівська область', 0);
  
  
-- adding votings

-- fields: voting_id, name, description, start_date, end_date

INSERT INTO votings VALUES 
    (0, 'Вибори Президента України', 'Перший тур виборів Президента України 2019', '2019-03-31 08:00', '2019-03-31 20:00'),
    (1, 'Вибори Президента України', 'Другий тур  виборів Президента України 2019', '2019-04-21 08:00', '2019-04-21 20:00'),
    (2, 'Вибори Президента України', 'Позачергові вибори Президента України 2014', '2014-05-25 08:00', '2014-05-25 20:00');


-- adding variants

-- fields: variant_id, voting_id, name, description

INSERT INTO variants VALUES
    (0, 0, 'Володимир Зеленський', 'художній керівник ТОВ «Квартал 95», безпартійний, проживає в Києві'),
    (1, 0, 'Петро Порошенко', 'екс-президент України, безпартійний, проживає в Києві'),
    (2, 0, 'Юлія Тимошенко', 'народний депутат України, голова фракції політичної партії "Всеукраїнське обєднання Батьківщина"'),
    (3, 0, 'Юрій Бойко', 'народний депутат України, член політичної партії «Опозиційний блок», проживає в Рубіжному Луганської області'),
    (4, 1, 'Володимир Зеленський', 'художній керівник ТОВ «Квартал 95», безпартійний, проживає в Києві'),
    (5, 1, 'Петро Порошенко', 'екс-президент України, безпартійний, проживає в Києві'),
    (6, 2, 'Петро Порошенко', 'народний депутат України, безпартійний, проживає в місті Києві'),
    (7, 2, 'Юлія Тимошенко', 'народний депутат України, голова фракції політичної партії "Всеукраїнське обєднання Батьківщина"'),
    (8, 2, 'Олег Ляшко', 'народний депутат України, член Радикальної Партії Олега Ляшка, проживає в місті Києві'),
    (9, 2, 'Анатолій Гриценко', 'народний депутат України, член політичної партії «Громадянська позиція», проживає в місті Києві');

